
&НаКлиенте
Процедура СертификатПриИзменении(Элемент)
	СертификатПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура СертификатПриИзмененииНаСервере()
	Если НЕ ЗначениеЗаполнено(Тема) Тогда
		Возврат;
	КонецЕсли;
	УдалитьСозданныеЭлементыФормы(ЭтаФорма);
	ПодготовитьФормуДляТестирования(ЭтаФорма);
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПодготовитьФормуДляТестирования(Форма)
	//Объект = Форма.Объект;
	Элементы = Форма.Элементы;
	//Элементы.Декорация1
	ГруппаСтраницы = Элементы.Добавить("ГруппаСтраницы", Тип("ГруппаФормы"), Форма);
	ГруппаСтраницы.Вид = ВидГруппыФормы.Страницы;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВопросыВариантыОтветов.Ссылка КАК Вопрос,
		|	ВопросыВариантыОтветов.Ответ,
		|	isnull(ВопросыВариантыОтветов.Правильный, Ложь) Как Пометка
		|ИЗ
		|	Справочник.Вопросы.ВариантыОтветов КАК ВопросыВариантыОтветов
		|ГДЕ
		|	ВопросыВариантыОтветов.Ссылка.Родитель В Иерархии (&Родитель)
		|	И
		|	НЕ ВопросыВариантыОтветов.Ссылка.ПометкаУдаления
		|ИТОГИ
		|ПО
		|	Вопрос";
	
	Запрос.УстановитьПараметр("Родитель", Форма.Тема);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаВопрос = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	НомерГруппы = 1;
	Пока ВыборкаВопрос.Следующий() Цикл
		ГруппаВопрос = Элементы.Добавить("ГруппаСтраница" + НомерГруппы, Тип("ГруппаФормы"), ГруппаСтраницы);
		ГруппаВопрос.Вид = ВидГруппыФормы.Страница;
		ГруппаВопрос.Заголовок = "Вопрос " + НомерГруппы;
		ГруппаВопрос.ОтображатьЗаголовок = Истина;

		Декорация = Элементы.Добавить("Декорация" + НомерГруппы, Тип("ДекорацияФормы"), ГруппаВопрос);
		Декорация.Заголовок = ВыборкаВопрос.Вопрос; 
		
		ДобавляемыеРеквизиты = Новый Массив;
		Реквизит = Новый РеквизитФормы("ВариантыОтветов" + НомерГруппы, Новый ОписаниеТипов("СписокЗначений"), , "Варианты ответов");
		ДобавляемыеРеквизиты.Добавить(Реквизит);
		Форма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
		ЭлементСписокЗначений = Элементы.Добавить("ВариантыОтветов" + НомерГруппы, Тип("ТаблицаФормы"), ГруппаВопрос);
		ЭлементСписокЗначений.ПутьКДанным = "ВариантыОтветов" + НомерГруппы;
		//ЭлементСписокЗначений.КоманднаяПанель
		
		Элемент = Элементы.Добавить("ВариантыОтветовЗначение" + НомерГруппы, Тип("ПолеФормы"), ЭлементСписокЗначений);
		Элемент.Вид = ВидПоляФормы.ПолеВвода;
		Элемент.ПутьКДанным = "ВариантыОтветов" + НомерГруппы + ".Значение";
		Элемент = Элементы.Добавить("ВариантыОтветовПометка" + НомерГруппы, Тип("ПолеФормы"), ЭлементСписокЗначений);
		Элемент.Вид = ВидПоляФормы.ПолеФлажка;
		Элемент.ПутьКДанным = "ВариантыОтветов" + НомерГруппы + ".Пометка";
				
		ВыборкаДетальныеЗаписи = ВыборкаВопрос.Выбрать();
		
		СписокЗначений = Форма["ВариантыОтветов" + НомерГруппы];
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			СписокЗначений.Добавить(ВыборкаДетальныеЗаписи.Ответ);
		КонецЦикла;
		
		НомерГруппы = НомерГруппы + 1;
	КонецЦикла;	
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура УдалитьСозданныеЭлементыФормы(Форма)
	Для Каждого ЭлементФормы Из Форма.Элементы Цикл
		ф = 1;
	КонецЦикла;
КонецПроцедуры