
&НаКлиенте
Процедура СертификатПриИзменении(Элемент)
	СертификатПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура СертификатПриИзмененииНаСервере()
	//ПодготовитьФормуДляТестирования(ЭтаФорма, Объект.Сертификат);
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПодготовитьФормуДляТестирования(Форма)
	Объект = Форма.Объект;
	Элементы = Форма.Элементы;
	
	//сначала удаляем все созданные элементы формы
	УдалитьСозданныеЭлементыФормы(Форма);
КонецПроцедуры

&НаСервереБезКонтекста
Процедура УдалитьСозданныеЭлементыФормы(Форма)
	Для Каждого ЭлементФормы Из Форма.Элементы Цикл
		ф = 1;
	КонецЦикла;
КонецПроцедуры