
&НаКлиенте
Процедура СертификатПриИзменении(Элемент)
	СертификатПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура СертификатПриИзмененииНаСервере()
	Если НЕ ЗначениеЗаполнено(Тема) Тогда
		Возврат;
	КонецЕсли;
	УдалитьСозданныеЭлементыФормы(ЭтаФорма);
	ПодготовитьФормуДляТестирования(ЭтаФорма);
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПодготовитьФормуДляТестирования(Форма)
	//Объект = Форма.Объект;
	Элементы = Форма.Элементы;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВопросыВариантыОтветов.Ссылка КАК Вопрос,
		|	ВопросыВариантыОтветов.Ответ,
		|	isnull(ВопросыВариантыОтветов.Правильный, Ложь) Как Пометка
		|ИЗ
		|	Справочник.Вопросы.ВариантыОтветов КАК ВопросыВариантыОтветов
		|ГДЕ
		|	ВопросыВариантыОтветов.Ссылка.Родитель В Иерархии (&Родитель)
		|	И
		|	НЕ ВопросыВариантыОтветов.Ссылка.ПометкаУдаления
		|ИТОГИ
		|ПО
		|	Вопрос";
	
	Запрос.УстановитьПараметр("Родитель", Форма.Тема);
	
	Если Форма.Отладка Тогда
		Запрос.Текст =
			"ВЫБРАТЬ
			|	ВопросыВариантыОтветов.Ссылка КАК Вопрос,
			|	ВопросыВариантыОтветов.Ответ КАК Ответ,
			|	ЕСТЬNULL(ВопросыВариантыОтветов.Правильный, ЛОЖЬ) КАК Пометка
			|ИЗ
			|	Справочник.Вопросы.ВариантыОтветов КАК ВопросыВариантыОтветов
			|ГДЕ
			|	ВопросыВариантыОтветов.Ссылка.Родитель В ИЕРАРХИИ (&Родитель)
			|	И
			|	НЕ ВопросыВариантыОтветов.Ссылка.ПометкаУдаления
			|ИТОГИ
			|	МАКСИМУМ(Пометка)
			|ПО
			|	Вопрос";
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаВопрос = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	НомерГруппы = 1;
	НомерВопроса = 1;
	НомерВопросаГруппы = 1;
	СоздатьГруппу = Истина;
	Пока ВыборкаВопрос.Следующий() Цикл
		
		Если (Форма.Отладка И ВыборкаВопрос.Пометка) Тогда
			Продолжить;
		КонецЕсли;
		
		Если СоздатьГруппу Тогда
			ГруппаСтраницы = Элементы.Добавить("ГруппаСтраницы" + НомерГруппы, Тип("ГруппаФормы"), Форма);
			ГруппаСтраницы.Вид = ВидГруппыФормы.Страницы;
			СоздатьГруппу = Ложь;
		КонецЕсли;
		
		ГруппаВопрос = Элементы.Добавить("ГруппаСтраница" + НомерВопроса, Тип("ГруппаФормы"), ГруппаСтраницы);
		ГруппаВопрос.Вид = ВидГруппыФормы.Страница;
		ГруппаВопрос.Заголовок = "Вопрос " + НомерВопроса;
		ГруппаВопрос.ОтображатьЗаголовок = Истина;

		Декорация = Элементы.Добавить("Декорация" + НомерВопроса, Тип("ДекорацияФормы"), ГруппаВопрос);
		Декорация.Заголовок = ВыборкаВопрос.Вопрос; 
		
		ДобавляемыеРеквизиты = Новый Массив;
		Реквизит = Новый РеквизитФормы("ВариантыОтветов" + НомерВопроса, Новый ОписаниеТипов("СписокЗначений"), , "Варианты ответов");
		ДобавляемыеРеквизиты.Добавить(Реквизит);
		
		Если (Форма.Отладка) Тогда
			ВопросСсылка = Новый РеквизитФормы("Вопрос" + НомерВопроса, Новый ОписаниеТипов("СправочникСсылка.Вопросы"), , "Вопрос");
			ДобавляемыеРеквизиты.Добавить(ВопросСсылка);
		КонецЕсли;
		
		Форма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
		ЭлементСписокЗначений = Элементы.Добавить("ВариантыОтветов" + НомерВопроса, Тип("ТаблицаФормы"), ГруппаВопрос);
		ЭлементСписокЗначений.ПутьКДанным = "ВариантыОтветов" + НомерВопроса;
		ЭлементСписокЗначений.КоманднаяПанель.Видимость = Ложь;

		Если (Форма.Отладка) Тогда
			Форма["Вопрос" + НомерВопроса] = ВыборкаВопрос.Вопрос;
			ЭлементВопросСсылка = Элементы.Добавить("ВопросСсылка" + НомерВопроса, Тип("ПолеФормы"), ГруппаВопрос);
			ЭлементВопросСсылка.ПутьКДанным = "Вопрос" + НомерВопроса;
			ЭлементВопросСсылка.Вид = ВидПоляФормы.ПолеВвода;
			ЭлементВопросСсылка.ТолькоПросмотр = Истина;
		КонецЕсли;
		
		Элемент = Элементы.Добавить("ВариантыОтветовЗначение" + НомерВопроса, Тип("ПолеФормы"), ЭлементСписокЗначений);
		Элемент.Вид = ВидПоляФормы.ПолеВвода;
		Элемент.ПутьКДанным = "ВариантыОтветов" + НомерВопроса + ".Значение";
		Элемент = Элементы.Добавить("ВариантыОтветовПометка" + НомерВопроса, Тип("ПолеФормы"), ЭлементСписокЗначений);
		Элемент.Вид = ВидПоляФормы.ПолеФлажка;
		Элемент.ПутьКДанным = "ВариантыОтветов" + НомерВопроса + ".Пометка";
				
		ВыборкаДетальныеЗаписи = ВыборкаВопрос.Выбрать();
		
		СписокЗначений = Форма["ВариантыОтветов" + НомерВопроса];
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			СписокЗначений.Добавить(ВыборкаДетальныеЗаписи.Ответ);
		КонецЦикла;
		
		НомерВопроса = НомерВопроса + 1;
		НомерВопросаГруппы = НомерВопросаГруппы + 1;
		
		//ОТЛАДКА
		Если НомерВопросаГруппы = 21 Тогда
			СоздатьГруппу = Истина;
			НомерГруппы = НомерГруппы + 1;
			НомерВопросаГруппы = 1;
		КонецЕсли;
	КонецЦикла;	
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура УдалитьСозданныеЭлементыФормы(Форма)
	Для Каждого ЭлементФормы Из Форма.Элементы Цикл
		ф = 1;
	КонецЦикла;
КонецПроцедуры